{
    "content": [
        [
            1,
            "Компания обдумывает, использовать ли клиент/сервер или одноранговую сеть. Каковы три характеристики одноранговой сети? (Выберите три.)",
            [
                "масштабируемая",
                "отсутствует централизованное администрирование",
                "легко создать",
                "лучшая производительность устройства при работе в качестве клиента и сервера",
                "меньше затрат на внедрение",
                "лучшая безопасность"
            ],
            [
                1,
                2,
                4
            ]
        ],
        [
            2,
            "Пользователь реализует безопасность в сети небольшого офиса. Какие два действия обеспечат минимальные требования безопасности для этой сети? (Выберите два.)",
            [
                "установка беспроводной сети",
                "установка антивирусного программного обеспечения",
                "внедрение системы обнаружения вторжений",
                "внедрение брандмауэра",
                "добавление специального устройства предотвращения вторжений"
            ],
            [
                1,
                3
            ]
        ],
        [
            3,
            "Какие два варианта подключения к Интернету не требуют прокладки физических кабелей к зданию? (Выберите два.)",
            [
                "спутниковый канал",
                "выделенная телефонная линия",
                "Коммутируемая телефонная линия",
                "Сотовая связь",
                "DSL"
            ],
            [
                0,
                3
            ]
        ],
        [
            4,
            "Какое утверждение описывает использование сетевой технологии Powerline?",
            [
                "Новые «умные» электрические кабели используются для расширения существующей домашней локальной сети.",
                "Домашняя локальная сеть устанавливается без использования физических кабелей.",
                "Точки беспроводного доступа используют адаптеры Powerline для распространения данных через домашнюю локальную сеть.",
                "Устройство подключается к существующей домашней локальной сети с помощью адаптера и существующей электрической проводки."
            ],
            [
                3
            ]
        ],
        [
            5,
            "Какую область сети ИТ-персоналу колледжа, скорее всего, придется перепроектировать в результате того, что многие учащиеся приносят в школу свои планшеты и смартфоны для доступа к школьным ресурсам?",
            [
                "Беспроводная сеть",
                "интранет",
                "экстранет",
                "проводная локальная сеть",
                "беспроводная глобальная сеть"
            ],
            [
                0
            ]
        ],
        [
            6,
            "Каковы две функции конечных устройств в сети? (Выберите два.)",
            [
                "Они являются интерфейсом между людьми и коммуникационной сетью.",
                "Они направляют данные по альтернативным путям в случае сбоев соединения.",
                "Они фильтруют поток данных для повышения безопасности.",
                "Они обеспечивают канал, по которому передается сетевое сообщение.",
                "Они создают данные, которые передаются через сеть."
            ],
            [
                0,
                4
            ]
        ],
        [
            7,
            "Что такое Интернет?",
            [
                "Это сеть, основанная на технологии Ethernet.",
                "Он обеспечивает доступ к сети для мобильных устройств.",
                "Он обеспечивает соединения через взаимосвязанные глобальные сети.",
                "Это частная сеть для организации с соединениями LAN и WAN."
            ],
            [
                2
            ]
        ],
        [
            8,
            "Сотрудник в филиале составляет предложение для клиента. Для этого сотруднику необходимо получить доступ к конфиденциальной информации о ценах с внутренних серверов в головном офисе. К какой сети будет иметь доступ сотрудник?",
            [
                "Internet",
                "Intranet",
                "Extranet",
                "Local Network"
            ],
            [
                2
            ]
        ],
        [
            9,
            "Какое устройство выполняет функцию определения пути, по которому сообщения должны проходить через объединенные сети?",
            [
                "маршрутизатор",
                "DSL-модем",
                "веб-сервер",
                "брандмауэр"
            ],
            [
                0
            ]
        ],
        [
            10,
            "Какой термин описывает состояние сети, когда спрос на сетевые ресурсы превышает доступную мощность?",
            [
                "конвергенция",
                "оптимизация",
                "перегрузка",
                "синхронизация"
            ],
            [
                2
            ]
        ],
        [
            11,
            "Какое выражение точно определяет термин bandwidth?",
            [
                "набор методов для управления использованием сетевых ресурсов",
                "метод ограничения воздействия аппаратного или программного сбоя на сеть",
                "состояние, когда спрос на сетевые ресурсы превышает доступные ресурсы",
                "мера пропускной способности среды передачи данных"
            ],
            [
                3
            ]
        ],
        [
            12,
            "Какая сеть способна передавать голос, видео, текст и графику по одним и тем же каналам связи.",
            [
                "Local",
                "Campus",
                "Extranet",
                "Converged"
            ],
            [
                3
            ]
        ],
        [
            13,
            "Какие два критерия используются для выбора сетевой среды из различных сетевых сред? (Выберите два.)",
            [
                "расстояние, на которое выбранная среда может успешно передавать сигнал",
                "стоимость конечных устройств, используемых в сети",
                "количество промежуточных устройств, установленных в сети",
                "Оборудование, в которое будет установлена выбранная среда",
                "типы данных, которые должны быть приоритетными"
            ],
            [
                0,
                3
            ]
        ],
        [
            14,
            "Какое утверждение описывает характеристику облачных вычислений?",
            [
                "Приложения могут быть доступны через Интернет отдельными пользователями или предприятиями с любого устройства в любой точке мира.",
                "Бизнес может напрямую подключаться к Интернету без использования интернет-провайдера.",
                "Устройства могут подключаться к Интернету через существующую электропроводку.",
                "Для доступа к облаку требуются инвестиции в новую инфраструктуру."
            ],
            [
                0
            ]
        ],
        [
            15,
            "Какие два утверждения описывают промежуточные устройства? (Выберите два.)",
            [
                "Промежуточные устройства изменяют содержимое данных.",
                "Промежуточные устройства соединяют отдельные хосты с сетью.",
                "Промежуточные устройства генерируют содержимое данных.",
                "Промежуточные устройства инициируют процесс инкапсуляции.",
                "Промежуточные устройства определяют путь передачи данных."
            ],
            [
                3,
                4
            ]
        ],
        [
            16,
            "Сетевой администратор реализует политику, требующую надежных и сложных паролей. Какую цель защиты данных поддерживает эта политика?",
            [
                "целостность данных",
                "избыточность данных",
                "конфиденциальность данных",
                "Качество данных"
            ],
            [
                2
            ]
        ],
        [
            17,
            "Аббревиатура___ относится к политике, которая позволяет сотрудникам использовать свои личные устройства в офисе для доступа к сети и другим ресурсам.",
            [
                "BYOD"
            ],
            [
                0
            ]
        ],
        [
            18,
            "К какой сети должен иметь доступ домашний пользователь, чтобы совершать покупки в Интернете?",
            [
                "интранет",
                "интернет",
                "локальная сеть",
                "экстранет"
            ],
            [
                1
            ]
        ],
        [
            19,
            "Какие два варианта подключения обеспечивают постоянное подключение к Интернету с высокой пропускной способностью для компьютеров в домашнем офисе? (Выберите два.)",
            [
                "спутниковый канал",
                "кабель",
                "коммутируемая телефонная линия",
                "DSL",
                "Сотовая связь"
            ],
            [
                1,
                3
            ]
        ],
        [
            20,
            "Какой тип сетевого трафика требует QoS?",
            [
                "он-лайн покупка",
                "видео-конференция",
                "Эл. почта",
                "wiki"
            ],
            [
                1
            ]
        ],
        [
            21,
            "Какое нарушение безопасности нанесет наибольший ущерб жизни домашнего пользователя?",
            [
                "отказ в обслуживании вашего почтового сервера",
                "захват личных данных, который приводит к краже личных данных",
                "шпионское ПО, которое приводит к спаму по электронной почте",
                "размножение червей и вирусов на вашем компьютере"
            ],
            [
                1
            ]
        ],
        [
            22,
            "Какое утверждение о работающем файле конфигурации ( running configuration file) на устройстве Cisco IOS верно?",
            [
                "Он влияет на работу устройства сразу после модификации.",
                "Его следует удалить с помощью команды erase running-config.",
                "Он хранится в NVRAM.",
                "Он автоматически сохраняется при перезагрузке роутера."
            ],
            [
                0
            ]
        ],
        [
            23,
            "Какая команда или комбинация клавиш позволяет пользователю вернуться на предыдущий уровень в иерархии команд?",
            [
                "exit",
                "Ctrl-Z",
                "end",
                "Ctrl-C"
            ],
            [
                0
            ]
        ],
        [
            24,
            "Какая процедура используется для доступа к коммутатору Cisco 2960 при выполнении начальной настройки в защищенной среде?",
            [
                "Используйте порт AUX для локального доступа к коммутатору через последовательный или USB-интерфейс ПК.",
                "Используйте консольный порт для локального доступа к коммутатору через последовательный или USB-интерфейс ПК.",
                "Используйте Telnet для удаленного доступа к коммутатору через сеть.",
                "Используйте Secure Shell для удаленного доступа к коммутатору по сети."
            ],
            [
                1
            ]
        ],
        [
            25,
            "Как команда service password-encryption повышает безопасность паролей на маршрутизаторах и коммутаторах Cisco?",
            [
                "Требуется, чтобы пользователь вводил зашифрованные пароли, чтобы получить консольный доступ к маршрутизатору или коммутатору.",
                "Она требует использования зашифрованных паролей при удаленном подключении к маршрутизатору или коммутатору с помощью Telnet.",
                "Она шифрует пароли, хранящиеся в файлах конфигурации маршрутизатора или коммутатора.",
                "Он шифрует пароли, когда они отправляются по сети."
            ],
            [
                2
            ]
        ],
        [
            26,
            "Сетевому администратору необходимо сохранять в тайне идентификатор пользователя, пароль и содержимое сеанса при установлении удаленного соединения CLI с коммутатором для управления им. Какой способ доступа выбрать?",
            [
                "SSH",
                "AUX",
                "Console",
                "Telnet"
            ],
            [
                0
            ]
        ],
        [
            27,
            "Технический специалист добавляет новый ПК в локальную сеть. После распаковки компонентов и выполнения всех подключений техник запускает ПК. После загрузки ОС технический специалист открывает браузер и проверяет, может ли ПК подключиться к Интернету. Почему ПК смог подключиться к сети без дополнительной настройки?",
            [
                "ПК не требует никакой дополнительной информации для работы в сети.",
                "ПК поставляется с предварительно настроенной информацией об IP-адресации на заводе.",
                "ПК был предварительно настроен на использование DHCP.",
                "Виртуальный интерфейс ПК совместим с любой сетью.",
                "ПК использовал DNS для автоматического получения информации об IP-адресах с сервера."
            ],
            [
                2
            ]
        ],
        [
            28,
            "Почему важно настроить имя хоста на устройстве?",
            [
                "имя хоста должно быть настроено перед любыми другими параметрами",
                "разрешить локальный доступ к устройству через консольный порт",
                "маршрутизатор или коммутатор Cisco начинает работать только тогда, когда установлено его имя хоста",
                "для идентификации устройства при удаленном доступе (SSH или telnet)"
            ],
            [
                3
            ]
        ],
        [
            29,
            "Пытаясь решить проблему с сетью, технический специалист внес несколько изменений в текущий файл конфигурации маршрутизатора. Изменения не решили проблему и не были сохранены. Какие действия может предпринять технический специалист, чтобы отменить изменения и работать с файлом в NVRAM?",
            [
                "Удалите файл vlan.dat и перезагрузите устройство.",
                "Выполните команду перезагрузки без сохранения текущей конфигурации.",
                "Введите команду copy startup-config running-config.",
                "Закройте и снова откройте программу эмуляции терминала."
            ],
            [
                1
            ]
        ],
        [
            30,
            "Что пытается определить пользователь, вводя команду ping 10.1.1.1 на ПК?",
            [
                "путь, по которому будет проходить трафик, чтобы достичь пункта назначения",
                "работает ли стек TCP/IP на ПК без передачи трафика по сети",
                "какой тип устройства находится в пункте назначения",
                "если есть связь с целевым устройством"
            ],
            [
                3
            ]
        ],
        [
            31,
            "Какой интерфейс позволяет удаленно управлять коммутатором уровня 2?",
            [
                "интерфейс AUX",
                "виртуальный интерфейс коммутатора",
                "интерфейс консольного порта",
                "первый интерфейс порта Ethernet"
            ],
            [
                1
            ]
        ],
        [
            32,
            "Какую информацию отображает команда show startup-config?",
            [
                "содержимое сохраненного конфигурационного файла в NVRAM",
                "программа начальной загрузки в ПЗУ",
                "содержимое текущего запущенного файла конфигурации в оперативной памяти",
                "образ IOS скопирован в оперативную память"
            ],
            [
                0
            ]
        ],
        [
            33,
            "TEMP=\"pic1.png\"Обратитесь к рисунку. Какие три факта можно определить из видимых выходных данных команды show ip interface brief? (Выберите три.)",
            [
                "SVI по умолчанию настроен.",
                "Одно устройство подключено к физическому интерфейсу.",
                "Были настроены два физических интерфейса.",
                "На коммутаторе настроены пароли.",
                "Коммутатором можно управлять удаленно.",
                "К коммутатору подключены два устройства."
            ],
            [
                0,
                1,
                4
            ]
        ],
        [
            34,
            "Какие две функции предоставляет пользователям контекстно-зависимая справка интерфейса командной строки Cisco IOS? (Выберите два.)",
            [
                "выбор лучшей команды для выполнения задачи",
                "предоставление сообщения об ошибке при отправке неправильной команды",
                "определение того, какая опция, ключевое слово или аргумент доступны для введенной команды",
                "позволяя пользователю завершить оставшуюся часть сокращенной команды с помощью клавиши TAB",
                "отображение списка всех доступных команд в текущем режиме"
            ],
            [
                2,
                4
            ]
        ],
        [
            35,
            "Какова функция ядра операционной программы?",
            [
                "Он предоставляет пользовательский интерфейс, который позволяет пользователям запрашивать конкретную задачу.",
                "Ядро выделяет аппаратные ресурсы для удовлетворения требований программного обеспечения.",
                "Ядро связывает драйверы оборудования с базовой электроникой компьютера.",
                "Это приложение, позволяющее выполнить первоначальную настройку устройства Cisco."
            ],
            [
                1
            ]
        ],
        [
            36,
            "Какую команду можно использовать на ПК с Windows, чтобы увидеть IP-конфигурацию этого компьютера?",
            [
                "ping",
                "show ip interface brief",
                "ipconfig",
                "show interfaces"
            ],
            [
                2
            ]
        ],
        [
            37,
            "Маршрутизатор имеет действующую операционную систему и файл конфигурации, хранящийся в NVRAM. Файл конфигурации содержит пароль enable secret, но не пароль консоли. Когда маршрутизатор загрузится, какой режим будет отображаться?",
            [
                "пользовательский режим EXEC",
                "режим настройки",
                "режим глобальной конфигурации",
                "привилегированный режим EXEC"
            ],
            [
                0
            ]
        ],
        [
            38,
            "TEMP=\"pic2.png\"Обратитесь к рисунку. Сетевой администратор настраивает баннер на коммутаторе SW1. Какова цель этой команды?",
            [
                "заставить пользователей группы Admin вводить пароль для аутентификации",
                "для отображения сообщения, когда пользователь обращается к  коммутатору",
                "настроить коммутатор SW1 таким образом, чтобы сообщение отображалось, когда пользователь вводит команду enable",
                "настроить коммутатор SW1 таким образом, чтобы только пользователи из группы администраторов могли подключаться к SW1 через telnet."
            ],
            [
                1
            ]
        ],
        [
            39,
            "Какой интерфейс является SVI по умолчанию на коммутаторе Cisco?",
            [
                "FastEthernet 0/1",
                "VLAN 1",
                "VLAN 99",
                "GigabitEthernet 0/1"
            ],
            [
                1
            ]
        ],
        [
            40,
            "Каковы две характеристики оперативной памяти на устройстве Cisco? (Выберите два.)",
            [
                "Содержимое оперативной памяти теряется при выключении питания.",
                "Оперативная память обеспечивает энергонезависимую память.",
                "Оперативная память способна хранить несколько версий IOS и файлов конфигурации.",
                "Оперативная память является компонентом коммутаторов Cisco, но не маршрутизаторов Cisco.",
                "Конфигурация, которая активно работает на устройстве, хранится в оперативной памяти."
            ],
            [
                0,
                4
            ]
        ],
        [
            41,
            "TEMP=\"pic3.png\"Обратитесь к рисунку. Сетевой техник проверяет возможность подключения в новой сети. Основываясь на результатах испытаний, показанных на рисунке, с каким устройством технический специалист имеет возможность подключения, а с каким устройством у него нет подключения? (Выберите два.)",
            [
                "нет подключения: switch 1",
                "возможность подключение: switch 2",
                "возможность подключения: PC-B",
                "нет возможности подключения: PC-C",
                "нет подключения: switch 2",
                "возможность подключения: PC-D"
            ],
            [
                1,
                3
            ]
        ],
        [
            42,
            "Зачем коммутатору уровня 2 IP-адрес?",
            [
                "чтобы коммутатор работал в качестве шлюза по умолчанию",
                "для удаленного управления коммутатором",
                "чтобы коммутатор мог получать кадры от подключенных ПК",
                "чтобы коммутатор мог отправлять широковещательные кадры на подключенные ПК"
            ],
            [
                1
            ]
        ],
        [
            43,
            "Какие два имени хоста соответствуют рекомендациям по соглашению об именах на устройствах Cisco IOS? (Выберите два.)",
            [
                "SwBranch799",
                "RM-3-Switch-2A4",
                "HO Floor 17",
                "Branch2!",
                "Floor(15)"
            ],
            [
                0,
                1
            ]
        ],
        [
            44,
            "Какой процесс используется для помещения одного сообщения в другое сообщение для передачи от источника к получателю?",
            [
                "инкапсуляция",
                "дешифрование",
                "управление потоком",
                "контроль доступа"
            ],
            [
                0
            ]
        ],
        [
            45,
            "Какой PDU обрабатывается, когда хост-компьютер деинкапсулирует сообщение на транспортном уровне модели TCP/IP?",
            [
                "segment",
                "bits",
                "frame",
                "packet"
            ],
            [
                0
            ]
        ],
        [
            46,
            "Какая характеристика описывает шлюз по умолчанию хост-компьютера?",
            [
                "логический адрес, назначенный интерфейсу коммутатора, подключенному к маршрутизатору",
                "логический адрес интерфейса маршрутизатора в той же сети, что и главный компьютер",
                "физический адрес интерфейса коммутатора, подключенного к хост-компьютеру",
                "физический адрес интерфейса маршрутизатора в той же сети, что и хост"
            ],
            [
                1
            ]
        ],
        [
            47,
            "Какое утверждение о сетевых протоколах верно?",
            [
                "Они определяют, как происходит обмен сообщениями между источником и получателем.",
                "Все они функционируют на уровне сетевого доступа TCP/IP.",
                "Они необходимы только для обмена сообщениями между устройствами в удаленных сетях.",
                "Сетевые протоколы определяют тип используемого оборудования и способ его установки в стойках."
            ],
            [
                0
            ]
        ],
        [
            48,
            "Какие три протокола прикладного уровня входят в стек протоколов TCP/IP? (Выберите три.)",
            [
                "DNS",
                "FTP",
                "DHCP",
                "NAT",
                "ARP",
                "PPP"
            ],
            [
                0,
                1,
                2
            ]
        ],
        [
            49,
            "Какой формат PDU используется, когда биты принимаются из сетевой среды сетевой картой хоста?",
            [
                "segment",
                "file",
                "packet",
                "frame"
            ],
            [
                3
            ]
        ],
        [
            50,
            "Что произойдет, если адрес шлюза по умолчанию неправильно настроен на хосте?",
            [
                "Коммутатор не будет пересылать пакеты, инициированные хостом.",
                "Пинг от хоста до 127.0.0.1 не будет успешным.",
                "Хост должен будет использовать ARP для определения правильного адреса шлюза по умолчанию.",
                "Хост не может связываться с хостами в других сетях.",
                "Хост не может общаться с другими хостами в локальной сети."
            ],
            [
                3
            ]
        ],
        [
            51,
            "Какое утверждение верно в отношении моделей TCP/IP и OSI?",
            [
                "Уровень доступа к сети TCP/IP имеет функции, аналогичные сетевому уровню OSI.",
                "Уровень 7 OSI и прикладной уровень TCP/IP обеспечивают идентичные функции.",
                "Транспортный уровень TCP/IP и уровень 4 OSI предоставляют аналогичные услуги и функции.",
                "Первые три уровня OSI описывают общие службы, которые также предоставляются интернет-уровнем TCP/IP."
            ],
            [
                1
            ]
        ],
        [
            52,
            "Что такое проприетарные протоколы?",
            [
                "протоколы, разработанные частными организациями для работы на оборудовании любого поставщика",
                "протоколы, разработанные организациями, которые контролируют их определение и работу",
                "протоколы, которые могут свободно использоваться любой организацией или поставщиком",
                "набор протоколов, известный как набор протоколов TCP/IP"
            ],
            [
                1
            ]
        ],
        [
            53,
            "Какой метод могут использовать два компьютера, чтобы гарантировать, что пакеты не будут отброшены из-за того, что слишком много данных отправляется слишком быстро?",
            [
                "тайм-аут ответа",
                "управление потоком",
                "метод доступа",
                "инкапсуляция"
            ],
            [
                1
            ]
        ],
        [
            54,
            "TEMP=\"pic4.png\"Обратитесь к рисунку. Если бы Host1 передал файл на сервер, какие уровни модели TCP/IP были бы использованы?",
            [
                "только прикладной, транспортный, сетевой, канальный и физический уровни",
                "только уровни приложений, Интернета и доступа к сети",
                "прикладной, сеансовый, транспортный, сетевой, канальный и физический уровни",
                "уровни приложений, транспорта, Интернета и доступа к сети",
                "только прикладной и интернет-уровни",
                "только уровни доступа к Интернету и сети"
            ],
            [
                3
            ]
        ],
        [
            55,
            "TEMP=\"pic5.png\"Обратитесь к рисунку. HostA пытается связаться с ServerB. Какие два утверждения правильно описывают адресацию, которую HostA сгенерирует в процессе? (Выберите два.)",
            [
                "Кадр с MAC-адресом назначения RouterA.",
                "Кадр с MAC-адресом назначения SwitchA.",
                "Пакет с IP-адресом назначения ServerB.",
                "Пакет с IP-адресом назначения RouterB.",
                "Пакет с IP-адресом назначения RouterA.",
                "Кадр с MAC-адресом назначения ServerB."
            ],
            [
                0,
                2
            ]
        ],
        [
            56,
            "В чем преимущество сетевых устройств, использующих открытые стандартные протоколы?",
            [
                "Хост-клиент и сервер с разными операционными системами могут успешно обмениваться данными.",
                "Конкуренция и инновации ограничены конкретными видами продукции.",
                "Доступ в Интернет может контролироваться одним интернет-провайдером на каждом рынке.",
                "Сетевые коммуникации ограничиваются передачей данных между устройствами одного производителя."
            ],
            [
                0
            ]
        ],
        [
            57,
            "На каком уровне модели OSI будет инкапсулирован логический адрес?",
            [
                "транспортный уровень",
                "канальный уровень",
                "физический уровень",
                "сетевой уровень"
            ],
            [
                3
            ]
        ],
        [
            58,
            "Какой тип связи будет отправлять сообщение на все устройства в локальной сети?",
            [
                "broadcast",
                "allcast",
                "unicast",
                "multicast"
            ],
            [
                0
            ]
        ],
        [
            59,
            "Какие три уровня модели OSI сопоставимы по функциям с прикладным уровнем модели TCP/IP? (Выберите три.)",
            [
                "data link",
                "session",
                "network",
                "transport",
                "physical",
                "application",
                "presentation"
            ],
            [
                1,
                5,
                6
            ]
        ],
        [
            60,
            "В чем преимущество использования стандартов для разработки и реализации протоколов?",
            [
                "Разные производители могут применять разные требования при реализации протокола.",
                "Конкретный протокол может быть реализован только одним производителем.",
                "Продукты разных производителей могут успешно взаимодействовать.",
                "Стандарты обеспечивают производителям гибкость при создании устройств, соответствующих уникальным требованиям."
            ],
            [
                2
            ]
        ],
        [
            61,
            "Веб-клиент отправляет запрос веб-страницы на веб-сервер. С точки зрения клиента, каков правильный порядок стека протоколов, который используется для подготовки запроса к передаче?",
            [
                "Ethernet, TCP, IP, HTTP",
                "HTTP, IP, TCP, Ethernet",
                "HTTP, TCP, IP, Ethernet",
                "Ethernet, IP, TCP, HTTP"
            ],
            [
                2
            ]
        ],
        [
            62,
            "Какой адрес использует сетевая карта при принятии решения о приеме кадра?",
            [
                "исходный IP-адрес",
                "IP-адрес получателя",
                "Ethernet-адрес источника",
                "MAC-адрес назначения",
                "MAC-адрес источника"
            ],
            [
                3
            ]
        ],
        [
            63,
            "Что верно в отношении физических и логических топологий?",
            [
                "Логические топологии относятся к тому, как сеть передает данные между устройствами.",
                "Физические топологии связаны с тем, как сеть передает кадры.",
                "Логическая топология всегда совпадает с физической топологией.",
                "Физические топологии отображают схему IP-адресации каждой сети."
            ],
            [
                0
            ]
        ],
        [
            64,
            "Какое утверждение описывает топологию расширенной звезды?",
            [
                "Каждая конечная система подключена к соответствующему соседу через промежуточное устройство.",
                "Все конечные и промежуточные устройства соединены в цепочку друг с другом.",
                "Конечные устройства соединены шиной, и каждая шина соединяется с центральным промежуточным устройством.",
                "Конечные устройства подключаются к центральному промежуточному устройству, которое, в свою очередь, подключается к другим центральным промежуточным устройствам."
            ],
            [
                3
            ]
        ],
        [
            65,
            "Какой уровень модели OSI отвечает за определение метода инкапсуляции, используемого для конкретных типов среды?",
            [
                "транспортный",
                "канальный",
                "прикладной",
                "физический"
            ],
            [
                1
            ]
        ],
        [
            66,
            "Какой тип разъема использует сетевая карта?",
            [
                "RJ-11",
                "PS-2",
                "RJ-45",
                "DIN"
            ],
            [
                2
            ]
        ],
        [
            67,
            "TEMP=\"pic6.png\"Обратитесь к рисунку. Что не так с отображаемым окончанием кабеля?",
            [
                "Провода слишком толстые для используемого разъема.",
                "Используется неправильный тип разъема.",
                "Сплетенную медную оплетку удалять не следовало.",
                "Нескрученная длина каждого провода слишком велика."
            ],
            [
                3
            ]
        ],
        [
            68,
            "TEMP=\"pic7.png\"Обратитесь к рисунку. ПК подключен к консольному порту коммутатора. Все остальные подключения осуществляются через каналы FastEthernet. Какие типы кабелей UTP можно использовать для подключения устройств?",
            [
                "1 – консольный(rollover), 2 – прямой(straight-through), 3 – перекрестный(crossover)",
                "1 – перекрестный(crossover), 2 – прямой(straight-through), 3 – консольный(rollover)",
                "1 – перекрестный(crossover), 2 – консольный(rollover), 3 – прямой(straight-through)",
                "1 – консольный(rollover), 2 – перекрестный(crossover), 3 – прямой(straight-through)"
            ],
            [
                0
            ]
        ],
        [
            69,
            "Какова функция значения CRC, которое находится в поле FCS кадра?",
            [
                "проверить физический адрес во фрейме",
                "для проверки целостности полученного кадра",
                "для вычисления контрольной суммы заголовка для поля данных в кадре",
                "для проверки логического адреса во фрейме"
            ],
            [
                1
            ]
        ],
        [
            70,
            "Что обозначается термином пропускная способность?",
            [
                "мера полезности данных, передаваемых через среду",
                "время, необходимое для того, чтобы сообщение дошло от отправителя до получателя",
                "мера числа битов, переданных через среду за заданный период времени",
                "способность конкретного носителя передавать данные",
                "гарантированная скорость передачи данных, предлагаемая интернет-провайдером"
            ],
            [
                2
            ]
        ],
        [
            71,
            "Сетевой администратор разрабатывает схему новой беспроводной сети. Какие три проблемы следует учитывать при построении беспроводной сети? (Выберите три.)",
            [
                "зона покрытия",
                "помехи",
                "обширная кабельная разводка",
                "коллизия пакетов",
                "варианты мобильности",
                "безопасность"
            ],
            [
                0,
                1,
                5
            ]
        ],
        [
            72,
            "TEMP=\"pic8.png\"Обратитесь к рисунку. Какое утверждение описывает методы управления доступом к среде, используемые сетями на рисунке?",
            [
                "Все три сети используют CSMA/CA",
                "Сеть 1 использует CSMA/CD, а сеть 3 использует CSMA/CA.",
                "Сеть 2 использует CSMA/CA, а сеть 3 использует CSMA/CD.",
                "Ни одна из сетей не требует контроля доступа к среде.",
                "Сеть 1 использует CSMA/CA, а сеть 2 использует CSMA/CD."
            ],
            [
                1
            ]
        ],
        [
            73,
            "В чем преимущество оптоволоконного кабеля перед медным?",
            [
                "Обычно это дешевле, чем медный кабель.",
                "Его проще подключить и установить, чем медный кабель.",
                "Возможна установка на резких поворотах.",
                "Он способен передавать сигналы намного дальше, чем медный кабель."
            ],
            [
                3
            ]
        ],
        [
            74,
            "Когда данные передаются по носителю в виде потока 1 и 0, как принимающий узел идентифицирует начало и конец кадра?",
            [
                "Передающий узел посылает приемнику внеполосный сигнал о начале кадра.",
                "Передающий узел вставляет в кадр стартовый и стоповый биты.",
                "Принимающий узел идентифицирует начало кадра, видя физический адрес.",
                "Передающий узел отправляет синхропоследовательность, чтобы уведомить о том, что далее передаются  данныее"
            ],
            [
                3
            ]
        ],
        [
            75,
            "Что содержится в трейлере кадра канала передачи данных?",
            [
                "код для обнаружения ошибок",
                "физический адрес",
                "данные",
                "логический адрес"
            ],
            [
                0
            ]
        ],
        [
            76,
            "Какой метод используется с кабелем UTP для защиты от перекрестных помех?",
            [
                "помещение кабелей в гибкую пластиковую оболочку",
                "заделка кабеля специальными заземленными разъемами",
                "обернуть экран из фольги вокруг пар проводов",
                "скручивание проводов в пары"
            ],
            [
                3
            ]
        ],
        [
            77,
            "Какие две функции выполняет канальный уровень модели OSI? (Выберите два.)",
            [
                "Он определяет путь для пересылки пакетов.",
                "Он принимает пакеты уровня 3 и инкапсулирует их в кадры.",
                "Он отслеживает связь уровня 2, создавая таблицу MAC-адресов.",
                "Он обеспечивает контроль доступа к среде и выполняет обнаружение ошибок.",
                "Он шифрует пакеты данных."
            ],
            [
                1,
                3
            ]
        ],
        [
            78,
            "Какая характеристика описывает перекрестные помехи?",
            [
                "искажение сетевого сигнала от люминесцентного освещения",
                "потеря беспроводного сигнала на чрезмерном расстоянии от точки доступа",
                "искажение передаваемых сообщений от сигналов, передаваемых по соседним проводам",
                "ослабление сетевого сигнала на длинных кабелях"
            ],
            [
                2
            ]
        ],
        [
            79,
            "По каким двум причинам протоколы физического уровня используют методы кодирования кадров? (Выберите два.)",
            [
                "увеличить пропускную способность среды",
                "отличать биты данных от битов управления",
                "чтобы обеспечить лучшее исправление ошибок среды",
                "уменьшить количество коллизий в среде",
                "чтобы определить, где кадр начинается и заканчивается"
            ],
            [
                0,
                4
            ]
        ],
        [
            80,
            "Сетевой администратор замечает, что некоторые недавно установленные кабели Ethernet передают поврежденные и искаженные сигналы данных. Новые кабели были проложены в потолке рядом с люминесцентными лампами и электрическим оборудованием. Какие два фактора могут мешать медному кабелю и приводить к искажению сигнала и повреждению данных? (Выберите два.)",
            [
                "радиочастотные помехи",
                "перекрестные помехи",
                "затухание сигнала",
                "электромагнитные помехи"
            ],
            [
                0,
                3
            ]
        ],
        [
            81,
            "Какой метод передачи данных позволяет одновременно отправлять и получать информацию?",
            [
                "half duplex",
                "full duplex",
                "multiplex",
                "simplex"
            ],
            [
                1
            ]
        ],
        [
            82,
            "Какая аббревиатура используется для обозначения подуровня канала передачи данных, который идентифицирует протокол сетевого уровня, инкапсулированный в кадре? __",
            [
                "LLC"
            ],
            [
                0
            ]
        ],
        [
            83,
            "Какое утверждение о MAC-адресах верно?",
            [
                "Первые три байта являются идентификатором, назначенным поставщику оборудования (OUI).",
                "ISO отвечает за регулирование MAC-адресов.",
                "MAC-адреса реализуются программным обеспечением.",
                "Сетевому адаптеру нужен только MAC-адрес, если он подключен к глобальной сети."
            ],
            [
                0
            ]
        ],
        [
            84,
            "Какое утверждение описывает Ethernet?",
            [
                "Он определяет наиболее распространенный тип локальной сети в мире.",
                "Он определяет стандартную модель, используемую для описания того, как работает сеть.",
                "Это необходимый стандарт уровня 1 и 2 для интернет-коммуникаций.",
                "Он соединяет несколько сайтов, таких как маршрутизаторы, расположенные в разных странах."
            ],
            [
                0
            ]
        ],
        [
            85,
            "Таблица ARP в коммутаторе сопоставляет какие два типа адресов вместе?",
            [
                "Адрес уровня 4 на адрес уровня 2",
                "Адрес уровня 3 на адрес уровня 2",
                "Адрес уровня 2 на адрес уровня 4",
                "Адрес уровня 3 на адрес уровня 4"
            ],
            [
                1
            ]
        ],
        [
            86,
            "ARP __ — это метод, который используется для отправки поддельных сообщений ARP другим хостам в локальной сети. Цель состоит в том, чтобы связать IP-адреса с неправильными MAC-адресами.",
            [
                "spoofing"
            ],
            [
                0
            ]
        ],
        [
            87,
            "Какое утверждение описывает характеристику MAC-адресов?",
            [
                "Они добавляются как часть PDU уровня 3.",
                "Они маршрутизируются только внутри частной сети.",
                "Они должны быть глобально уникальными.",
                "Они имеют 32-битное двоичное значение."
            ],
            [
                2
            ]
        ],
        [
            88,
            "Каковы два размера (минимальный и максимальный) кадра Ethernet? (Выберите два.)",
            [
                "64 байта",
                "128 байт",
                "1518 байт",
                "1024 байта",
                "56 байт"
            ],
            [
                0,
                2
            ]
        ],
        [
            89,
            "Какой метод коммутации использует значение CRC в кадре?",
            [
                "на лету",
                "быстрая пересылка",
                "коммутация с промежуточной буферизацией",
                "Безфрагментная коммутация"
            ],
            [
                2
            ]
        ],
        [
            90,
            "Фрагмент коллизии, также известный как кадр __, представляет собой кадр длиной менее 64 байт.",
            [
                "RUNT"
            ],
            [
                0
            ]
        ],
        [
            91,
            "Какой адрес назначения используется в кадре запроса ARP?",
            [
                "127.0.0.1",
                "255.255.255.255",
                "FFFF.FFFF.FFFF",
                "0.0.0.0",
                "01-00-5Е-00-АА-23"
            ],
            [
                2
            ]
        ],
        [
            92,
            "TEMP=\"pic9.png\"Обратитесь к рисунку. Коммутаторы находятся в конфигурации по умолчанию. Узел A должен связаться с узлом D, но у узла A нет MAC-адреса шлюза по умолчанию. Какие узлы сети получат запрос ARP, отправленный узлом А?",
            [
                "только хосты A, B, C и D",
                "только хосты B и C",
                "только роутер R1",
                "только хост D",
                "только хосты A, B и C",
                "только хосты B, C и маршрутизатор R1"
            ],
            [
                5
            ]
        ],
        [
            93,
            "TEMP=\"pic10.png\"Обратитесь к рисунку. Коммутатор с конфигурацией по умолчанию соединяет четыре хоста. Показана таблица ARP для хоста А. Что происходит, когда хост A хочет отправить IP-пакет на хост D?",
            [
                "Хост D отправляет запрос ARP на хост A.",
                "Хост A отправляет широковещательную рассылку FF:FF:FF:FF:FF:FF. Каждый другой хост, подключенный к коммутатору, получает широковещательную рассылку, а хост D отвечает своим MAC-адресом.",
                "Хост A отправляет запрос ARP на MAC-адрес хоста D.",
                "Хост A отправляет пакет коммутатору. Коммутатор отправляет пакет только хосту D, который, в свою очередь, отвечает."
            ],
            [
                1
            ]
        ],
        [
            94,
            "Какое утверждение описывает обработку запросов ARP в локальной сети?",
            [
                "Они принимаются и обрабатываются только целевым устройством.",
                "Они принимаются и обрабатываются каждым устройством в локальной сети.",
                "Они должны пересылаться всеми маршрутизаторами в локальной сети.",
                "Они отбрасываются всеми коммутаторами в локальной сети."
            ],
            [
                1
            ]
        ],
        [
            95,
            "TEMP=\"pic11.png\"Обратитесь к рисунку. ПК1 отправляет запрос ARP, поскольку ему необходимо отправить пакет на ПК2. В этом сценарии что будет дальше?",
            [
                "SW1 отправит ответ ARP со своим MAC-адресом Fa0/1.",
                "SW1 отправит ответ ARP с MAC-адресом ПК2.",
                "RT1 отправит ответ ARP со своим MAC-адресом Fa0/0.",
                "ПК2 отправит ответ ARP со своим MAC-адресом.",
                "RT1 отправит ответ ARP с MAC-адресом ПК2."
            ],
            [
                3
            ]
        ],
        [
            96,
            "Что происходит с RUNT-фреймами, полученными Ethernet коммутатором Cisco ?",
            [
                "Кадр отправляется на шлюз по умолчанию.",
                "Кадр отбрасывается.",
                "Кадр возвращается на исходное сетевое устройство.",
                "Кадр транслируется на все остальные устройства в той же сети."
            ],
            [
                1
            ]
        ],
        [
            97,
            "Какие две потенциальные проблемы с сетью могут возникнуть в результате работы ARP? (Выберите два.)",
            [
                "Ручная настройка статических ассоциаций ARP может облегчить отравление ARP или подделку MAC-адресов.",
                "В больших сетях с низкой пропускной способностью несколько широковещательных передач ARP могут вызвать задержки при передаче данных.",
                "Сетевые злоумышленники могут манипулировать сопоставлениями MAC-адресов и IP-адресов в сообщениях ARP с целью перехвата сетевого трафика.",
                "Большое количество широковещательных запросов ARP может привести к переполнению таблицы MAC-адресов узла и препятствовать обмену данными узла по сети.",
                "Несколько ответов ARP приводят к тому, что таблица MAC-адресов коммутатора содержит записи, соответствующие MAC-адресам хостов, подключенных к соответствующему порту коммутатора."
            ],
            [
                1,
                2
            ]
        ],
        [
            98,
            "Когда устройство отправляет данные на другое устройство в удаленной сети, кадр Ethernet отправляется на MAC-адрес шлюза по умолчанию.",
            [
                "Верно",
                "Неверно"
            ],
            [
                0
            ]
        ],
        [
            99,
            "Какие два утверждения описывают свойства или функции подуровня управления логическим каналом в стандартах Ethernet? (Выберите два.)",
            [
                "Канальный уровень использует LLC для связи с верхними уровнями набора протоколов.",
                "Управление логическим каналом указано в стандарте IEEE 802.3.",
                "Подуровень LLC отвечает за размещение и поиск кадров в среде и за ее пределами.",
                "Управление логической связью реализовано программно.",
                "Нижний уровень LLC добавляет к данным заголовок и трейлер."
            ],
            [
                0,
                3
            ]
        ],
        [
            100,
            "Какая информация об адресации записывается коммутатором для построения таблицы MAC-адресов?",
            [
                "исходный адрес уровня 3 исходящих пакетов",
                "адрес назначения уровня 3 входящих пакетов",
                "адрес назначения уровня 2 исходящих кадров",
                "исходный адрес уровня 2 входящих кадров"
            ],
            [
                3
            ]
        ],
        [
            101,
            "TEMP=\"pic12.png\"Обратитесь к рисунку. На рисунке показана небольшая коммутируемая сеть и содержимое таблицы MAC-адресов коммутатора. ПК1 отправил кадр, адресованный ПК3. Что коммутатор будет делать с кадром?",
            [
                "Коммутатор будет пересылать кадр только на порты 1 и 3.",
                "Коммутатор будет пересылать кадр только на порт 2.",
                "Коммутатор пересылает кадр на все порты, кроме порта 4.",
                "Коммутатор пересылает кадр на все порты.",
                "Коммутатор отбрасывает кадр."
            ],
            [
                2
            ]
        ],
        [
            102,
            "Что такое Auto-MDIX?",
            [
                "функция, которая автоматически определяет тип кабеля Ethernet",
                "тип коммутатора Cisco",
                "тип разъема Ethernet",
                "тип порта на коммутаторе Cisco"
            ],
            [
                0
            ]
        ],
        [
            103,
            "Какие три команды используются для настройки безопасного доступа к маршрутизатору через подключение к консольному интерфейсу? (Выберите три.)",
            [
                "line console 0",
                "password cisco",
                "interface fastethernet 0/0",
                "line vty 0 4",
                "enable secret cisco",
                "login"
            ],
            [
                0,
                1,
                5
            ]
        ],
        [
            104,
            "Какая характеристика сетевого уровня в модели OSI позволяет передавать пакеты по многим типам связей между хостами?",
            [
                "возможность работать независимо от данных, которые передаются в каждом пакете",
                "выбор путей и направление пакетов к месту назначения",
                "возможность управлять передачей данных между процессами, запущенными на хостах",
                "де-инкапсуляция заголовков нижних уровней"
            ],
            [
                1
            ]
        ],
        [
            105,
            "Какова цель файла стартовой конфигурации на маршрутизаторе Cisco?",
            [
                "предоставить ограниченную резервную версию IOS на случай, если маршрутизатор не сможет загрузить полнофункциональную IOS",
                "для облегчения базовой работы аппаратных компонентов устройства",
                "содержать команды конфигурации, которые будет использовать IOS маршрутизатора"
            ],
            [
                2
            ]
        ],
        [
            106,
            "Какие две части информации находятся в ОЗУ маршрутизатора Cisco при нормальной работе? (Выберите два.)",
            [
                "Cisco IOS",
                "basic diagnostic software",
                "backup IOS file",
                "startup configuration file",
                "IP routing table"
            ],
            [
                0,
                4
            ]
        ],
        [
            107,
            "Когда на нижнем уровне модели OSI используется протокол без установления соединения, как обнаруживаются и при необходимости передаются отсутствующие данные?",
            [
                "Процесс доставки с наилучшими усилиями гарантирует, что все отправленные пакеты будут получены.",
                "Подтверждения без установления соединения используются для запроса повторной передачи.",
                "Протоколы верхнего уровня, ориентированные на соединение, отслеживают полученные данные и могут запрашивать повторную передачу от протоколов верхнего уровня на хосте-отправителе.",
                "IP-протоколы сетевого уровня управляют сеансами связи, если транспортные службы, ориентированные на соединение, недоступны."
            ],
            [
                2
            ]
        ],
        [
            108,
            "Следуя настройкам по умолчанию, какой следующий шаг в последовательности загрузки маршрутизатора после загрузки IOS из флэш-памяти?",
            [
                "Загрузка программы начальной загрузки из ПЗУ.",
                "Выполнение процедуру POST.",
                "Поиск и загрузка файла стартовой конфигурации из NVRAM.",
                "Загрузка файла текущей конфигурации из ОЗУ."
            ],
            [
                2
            ]
        ],
        [
            109,
            "Каковы две характеристики IP? (Выберите два.)",
            [
                "работает независимо от сетевой среды",
                "гарантирует доставку пакетов",
                "повторно собирает неупорядоченные пакеты в правильном порядке на стороне получателя",
                "не требует выделенного двухточечного соединения",
                "повторно передает пакеты в случае возникновения ошибок"
            ],
            [
                0,
                3
            ]
        ],
        [
            110,
            "В какой записи таблицы маршрутизации указан адрес следующего перехода, связанный с сетью назначения?",
            [
                "маршруты с прямым подключением",
                "удаленные маршруты",
                "местные маршруты",
                "Исходные маршруты C и L"
            ],
            [
                1
            ]
        ],
        [
            111,
            "Маршрутизатор загружается и входит в setup mode. Что является причиной этого?",
            [
                "Cisco IOS отсутствует во флэш-памяти.",
                "Процесс POST обнаружил аппаратный сбой.",
                "Файл конфигурации отсутствует в NVRAM.",
                "Образ IOS поврежден."
            ],
            [
                1
            ]
        ],
        [
            112,
            "Какое поле заголовка IPv4 идентифицирует протокол верхнего уровня, передаваемый в пакете?",
            [
                "Differentiated Services",
                "Protocol",
                "Identification",
                "Version"
            ],
            [
                1
            ]
        ],
        [
            113,
            "TEMP=\"pic13.png\"Обратитесь к рисунку. R1 получает пакет, предназначенный для IP-адреса 192.168.2.10. Из какого интерфейса R1 будет пересылать пакет?",
            [
                "Serial0/0/0",
                "Serial0/0/1",
                "FastEthernet0/1",
                "FastEthernet0/0"
            ],
            [
                1
            ]
        ],
        [
            114,
            "Какая характеристика описывает улучшение IPv6 по сравнению с IPv4?",
            [
                "Адресное пространство IPv6 в четыре раза больше, чем адресное пространство IPv4.",
                "И IPv4, и IPv6 поддерживают аутентификацию, но только IPv6 поддерживает возможности конфиденциальности.",
                "Заголовок IPv6 проще, чем заголовок IPv4, что улучшает обработку пакетов.",
                "Адреса IPv6 основаны на 128-битной плоской адресации, в отличие от IPv4, который основан на 32-битной иерархической адресации."
            ],
            [
                2
            ]
        ],
        [
            115,
            "В чем преимущество упрощенного заголовка IPv6 по сравнению с IPv4?",
            [
                "небольшие требования к обработке контрольных сумм",
                "заголовок меньшего размера",
                "IP-адреса источника и назначения меньшего размера",
                "эффективная обработка пакетов"
            ],
            [
                3
            ]
        ],
        [
            116,
            "Какое утверждение описывает оборудование маршрутизатора Cisco 1941 с аппаратной конфигурацией по умолчанию?",
            [
                "Он имеет три интерфейса FastEthernet для доступа к локальной сети.",
                "Он не требует процессора, потому что он полагается на Compact Flash для запуска IOS.",
                "У него нет порта AUX.",
                "Он имеет два типа портов, которые можно использовать для доступа к консоли."
            ],
            [
                3
            ]
        ],
        [
            117,
            "Какой тип маршрута обозначается кодом C в таблице маршрутизации IPv4 на маршрутизаторе Cisco?",
            [
                "маршрут с прямым подключением",
                "маршрут по умолчанию",
                "статический маршрут",
                "динамический маршрут, полученный через EIGRP"
            ],
            [
                0
            ]
        ],
        [
            118,
            "TEMP=\"pic14.png\"Обратитесь к рисунку. Какой маршрут из таблицы маршрутизации ПК1 будет использоваться для доступа к ПК2?",
            [
                "Network destination: 0.0.0.0 Netmask: 0.0.0.0 Gateway: 192.168.10.1 Interface: 192.168.10.10 Metric: 25",
                "Network destination: 192.168.10.0 Netmask: 255.255.255.0 Gateway: On-link Interface: 192.168.10.10 Metric: 281",
                "Network destination: 127.0.0.1 Netmask: 255.255.255.255 Gateway: On-link Interface: 127.0.0.1 Metric: 306",
                "Network destination: 192.168.10.10 Netmask: 255.255.255.255 Gateway: On-link Interface: 192.168.10.10 Metric: 281"
            ],
            [
                1
            ]
        ],
        [
            119,
            "Какие существуют два типа интерфейсов маршрутизатора? (Выберите два.)",
            [
                "Telnet",
                "SVI",
                "WAN",
                "LAN",
                "DHCP"
            ],
            [
                2,
                3
            ]
        ],
        [
            120,
            "Сообщение отправляется всем хостам в определенной сети. Какой это тип сообщения?",
            [
                "unicast",
                "directed broadcast",
                "limited broadcast",
                "multicast"
            ],
            [
                1
            ]
        ],
        [
            121,
            "Какой тип адреса автоматически назначается интерфейсу, когда на этом интерфейсе включен IPv6?",
            [
                "link-local",
                "unique local",
                "loopback",
                "global unicast"
            ],
            [
                0
            ]
        ],
        [
            122,
            "Какова цель ICMP-сообщений?",
            [
                "контролировать процесс преобразования доменного имени в IP-адрес",
                "для обеспечения доставки IP-пакета",
                "для информирования маршрутизаторов об изменениях топологии сети",
                "для обеспечения обратной связи о передаче IP-пакетов"
            ],
            [
                3
            ]
        ],
        [
            123,
            "Какие три IP-адреса являются частными? (Выберите три.)",
            [
                "224.6.6.6",
                "192.168.5.5",
                "192 167.10.10",
                "172.16.4.4",
                "172.32.5.2",
                "10.1.1.1"
            ],
            [
                1,
                3,
                5
            ]
        ],
        [
            124,
            "Из каких трех частей состоит глобальный индивидуальный адрес IPv6? (Выберите три.)",
            [
                "глобальный префикс маршрутизации, используемый для идентификации сетевой части адреса, предоставленного провайдером.",
                "глобальный префикс маршрутизации, который используется для идентификации части сетевого адреса, предоставленной локальным администратором",
                "идентификатор интерфейса, который используется для идентификации локального хоста в сети",
                "идентификатор интерфейса, который используется для идентификации локальной сети для определенного хоста",
                "идентификатор подсети, который используется для идентификации сетей внутри локального корпоративного сайта."
            ],
            [
                0,
                2,
                4
            ]
        ],
        [
            125,
            "Какой из этих адресов является кратчайшим сокращением IP-адреса: 3FFE:1044:0000:0000:00AB:0000:0000:0057?",
            [
                "3FFE:1044::ЕС::57",
                "3FFE:1044:0:0:00AB::0057",
                "3FFE:1044::00AB::0057",
                "3FFE:1044:0000:0000:00EU::57",
                "3FFE:1044:0000:0000:00AB::0057",
                "3FFE:1044:0:0:AB::57"
            ],
            [
                5
            ]
        ],
        [
            126,
            "Сколько битов в адресе IPv4?",
            [
                "64",
                "32",
                "256",
                "128"
            ],
            [
                1
            ]
        ],
        [
            127,
            "Какова цель маски подсети в сочетании с IP-адресом?",
            [
                "определить подсеть, к которой принадлежит хост",
                "для маскировки IP-адреса от посторонних",
                "однозначно идентифицировать хост в сети",
                "чтобы определить, является ли адрес общедоступным или частным"
            ],
            [
                2
            ]
        ],
        [
            128,
            "Пользователь выполняет трассировку на удаленном устройстве. В какой момент маршрутизатор, находящийся на пути к целевому устройству, прекратит пересылку пакета?",
            [
                "когда хост отвечает сообщением ICMP Echo Reply",
                "когда значение RTT достигает нуля",
                "когда значение в поле TTL достигает нуля",
                "когда значения обоих сообщений Echo Request и Echo Reply достигают нуля",
                "когда маршрутизатор получает сообщение ICMP Time Exceeded"
            ],
            [
                2
            ]
        ],
        [
            129,
            "Что представляет собой IP-адрес 172.17.4.250/24?",
            [
                "адрес сети",
                "широковещательный адрес",
                "адрес хоста",
                "многоадресный адрес"
            ],
            [
                2
            ]
        ],
        [
            130,
            "Какой протокол поддерживает автоматическую настройку адресов без сохранения состояния (SLAAC) для динамического назначения адресов IPv6 хосту?",
            [
                "ICMPv6",
                "ARPv6",
                "UDP",
                "DHCPv6"
            ],
            [
                0
            ]
        ],
        [
            131,
            "Какая маска подсети представлена обозначением /20?",
            [
                "255.255.255.248",
                "255.255.224.0",
                "255.255.255.192",
                "255.255.255.0",
                "255.255.240.0"
            ],
            [
                4
            ]
        ],
        [
            132,
            "Администратор хочет настроить узлы для автоматического назначения IPv6-адресов с помощью сообщений объявления маршрутизатора, а также для получения адреса DNS-сервера от сервера DHCPv6. Какой метод назначения адресов следует настроить?",
            [
                "stateless DHCPv6",
                "RA and EUI-64",
                "SLAAC",
                "statefull DHCPv6"
            ],
            [
                0
            ]
        ],
        [
            133,
            "Чему равен десятичный эквивалент двоичного числа 10010101?",
            [
                "149"
            ],
            [
                0
            ]
        ],
        [
            134,
            "Какие два параметра можно определить с помощью команды ping? (Выберите два.)",
            [
                "количество маршрутизаторов между исходным и целевым устройством",
                "IP-адрес маршрутизатора, ближайшего к целевому устройству",
                "целевое устройство доступно через сеть",
                "среднее время, необходимое каждому маршрутизатору на пути между источником и пунктом назначения для ответа",
                "среднее время, необходимое пакету для достижения пункта назначения и возврата ответа к источнику"
            ],
            [
                2,
                4
            ]
        ],
        [
            135,
            "Каков десятичный эквивалент шестнадцатеричного числа 0x3F?",
            [
                "63"
            ],
            [
                0
            ]
        ],
        [
            136,
            "Какие две части являются компонентами адреса IPv4? (Выберите два.)",
            [
                "физическая часть",
                "сетевая часть",
                "широковещательная часть",
                "узловая часть",
                "часть подсети",
                "логическая часть"
            ],
            [
                1,
                3
            ]
        ],
        [
            137,
            "Какие два метода перехода с IPv4 на IPv6 обеспечивают взаимосвязь доменов IPv6? (Выберите два.)",
            [
                "trunking",
                "tunneling",
                "encapsulation",
                "multiplexing",
                "dual stack"
            ],
            [
                1,
                4
            ]
        ],
        [
            138,
            "Какие существуют два типа одноадресных адресов IPv6? (Выберите два.)",
            [
                "broadcast",
                "anycast",
                "link-local",
                "multicast",
                "loopback"
            ],
            [
                2,
                4
            ]
        ],
        [
            139,
            "На что указывает успешный эхо-запрос на IPv6-адрес ::1?",
            [
                "IPv6 правильно установлен на хосте.",
                "Доступны все хосты по локальной ссылке.",
                "Адрес link-local настроен правильно.",
                "Адрес шлюза по умолчанию настроен правильно.",
                "Хост подключен кабелем правильно."
            ],
            [
                0
            ]
        ],
        [
            140,
            "Каковы три характеристики многоадресной передачи? (Выберите три.)",
            [
                "Компьютеры используют многоадресную передачу для запроса адресов IPv4.",
                "Многоадресные сообщения сопоставляют адреса нижнего уровня с адресами верхнего уровня.",
                "Один пакет может быть отправлен группе хостов.",
                "Многоадресная передача может использоваться маршрутизаторами для обмена маршрутной информацией.",
                "Адрес источника многоадресной передачи находится в диапазоне от 224.0.0.0 до 224.0.0.255.",
                "Диапазон от 224.0.0.0 до 224.0.0.255 зарезервирован для доступа к многоадресным группам в локальной сети."
            ],
            [
                2,
                3,
                5
            ]
        ],
        [
            141,
            "Содержимое какого поля используется ICMPv6 для определения того, что срок действия пакета истек?",
            [
                "Hop Limit field",
                "CRC field",
                "TTL field",
                "Time Exceeded field"
            ],
            [
                0
            ]
        ],
        [
            142,
            "Чему равен двоичный эквивалент десятичного числа 232?",
            [
                "11101000"
            ],
            [
                0
            ]
        ],
        [
            143,
            "TEMP=\"pic15.png\"Обратитесь к рисунку. Компания использует адресный блок 128.107.0.0/16 для своей сети. Какая маска подсети обеспечит максимальное количество подсетей одинакового размера при достаточном количестве адресов узлов для каждой подсети на рисунке?",
            [
                "255.255.255.192",
                "255.255.255.0",
                "255.255.255.128",
                "255.255.255.240",
                "255.255.255.224"
            ],
            [
                2
            ]
        ],
        [
            144,
            "Какая маска подсети будет использоваться, если узловая часть адреса имеет длину 5 бит?",
            [
                "255.255.255.224",
                "255.255.255.240",
                "255.255.255.128",
                "255.255.255.0"
            ],
            [
                0
            ]
        ],
        [
            145,
            "Сколько битов нужно заимствовать из хостовой части адреса, чтобы обеспечить работу маршрутизатора с пятью подключенными сетями?",
            [
                "два",
                "четыре",
                "три",
                "пять"
            ],
            [
                2
            ]
        ],
        [
            146,
            "Какой префикс для адреса хоста 2001:DB8:BC15:A:12AB::1/64?",
            [
                "2001: DB8: BC15: А",
                "2001: DB8: BC15: А: 1",
                "2001: DB8: BC15",
                "2001: DB8: BC15: А: 12"
            ],
            [
                0
            ]
        ],
        [
            147,
            "DHCP-сервер используется для динамического назначения IP-адресов хостам в сети. Пул адресов настроен на 192.168.10.0/24. В этой сети есть 3 принтера, которым необходимо использовать зарезервированные статические IP-адреса из пула. Сколько IP-адресов в пуле осталось для назначения другим хостам?",
            [
                "253",
                "254",
                "251",
                "252"
            ],
            [
                2
            ]
        ],
        [
            148,
            "TEMP=\"pic16.png\"Обратитесь к рисунку. Компания развертывает схему адресации IPv6 для своей сети. В проектном документе компании указано, что часть адресов  подсети IPv6 используется для новой иерархической структуры сети, при этом поле сайта представляет несколько географических объектов компании, поле подсайта представляет несколько кампусов на каждом сайте, а поле подсети служит для указания каждого сегмента сети, разделенного маршрутизаторами. Какое максимальное количество подсетей достигается при такой схеме на подсайт?",
            [
                "4",
                "16",
                "256",
                "0"
            ],
            [
                1
            ]
        ],
        [
            149,
            "TEMP=\"pic17.png\"Обратитесь к рисунку. Сколько существует широковещательных доменов?",
            [
                "3",
                "1",
                "4",
                "2"
            ],
            [
                2
            ]
        ],
        [
            150,
            "По каким двум причинам сетевой администратор может захотеть создать подсети? (Выберите два.)",
            [
                "уменьшение количества необходимых маршрутизаторов",
                "упрощает проектирование сети",
                "уменьшение количества необходимых коммутаторов",
                "повышается производительность сети",
                "легче реализовать политики безопасности"
            ],
            [
                1,
                4
            ]
        ],
        [
            151,
            "Каков результат соединения двух или более коммутаторов вместе?",
            [
                "Размер области коллизий увеличен.",
                "Размер широковещательного домена увеличен.",
                "Увеличено количество широковещательных доменов.",
                "Количество доменов коллизий уменьшено."
            ],
            [
                1
            ]
        ],
        [
            152,
            "Компания имеет сетевой адрес 192.168.1.64 с маской подсети 255.255.255.192. Компания хочет выделить две подсети, которые будут содержать 10 хостов и 18 хостов соответственно. Выбор каких двух сетей позволяет добиться этого? (Выберите два.)",
            [
                "192.168.1.192/28",
                "192.168.1.96/28",
                "192.168.1.128/27",
                "192.168.1.16/28",
                "192.168.1.64/27"
            ],
            [
                1,
                4
            ]
        ],
        [
            153,
            "TEMP=\"pic18.png\"Обратитесь к рисунку. Учитывая, что адреса уже используются и должны оставаться в пределах сетевого диапазона 10.16.10.0/24, какой адрес подсети можно назначить сети, содержащей 25 хостов?",
            [
                "10.16.10.160/26",
                "10.16.10.240/28",
                "10.16.10.64/27",
                "10.16.10.240/27",
                "10.16.10.128/28",
                "10.16.10.224/26"
            ],
            [
                2
            ]
        ],
        [
            154,
            "Сетевому администратору необходимо отслеживать сетевой трафик, входящий и исходящий из серверов в центре обработки данных. Какой тип схемы IP-адресации следует применять к этим устройствам?",
            [
                "адреса из разных подсетей для резервирования",
                "динамические адреса для уменьшения вероятности дублирования адресов",
                "предсказуемые статические IP-адреса для упрощения идентификации",
                "случайные статические адреса для повышения безопасности"
            ],
            [
                2
            ]
        ],
        [
            155,
            "Какие две причины обычно делают DHCP предпочтительным методом назначения IP-адресов узлам в больших сетях? (Выберите два.)",
            [
                "Это снижает нагрузку на персонал службы поддержки сети.",
                "Это гарантирует, что каждое устройство, которому нужен адрес, получит его.",
                "Это устраняет большинство ошибок конфигурации адресов.",
                "Он предоставляет адрес только тем устройствам, которым разрешено подключение к сети.",
                "Это гарантирует, что адреса применяются только к устройствам, которым требуется постоянный адрес."
            ],
            [
                0,
                2
            ]
        ],
        [
            156,
            "Сетевой администратор хочет иметь одну и ту же сетевую маску для всех подсетей в конкретной небольшой сети. На объекте имеются следующие подсети и количество устройств:IP-телефоны – 22 адресаПК – необходимо 20 адресовПринтеры – необходимо 2 адресаСканеры – необходимо 2 адресаПринято решение об использовании сети 192.168.10.0/24. Какая единственная маска подсети позволит наиболее эффективно использовать доступные адреса для четырех подсетей?",
            [
                "255.255.255.248",
                "255.255.255.0",
                "255.255.255.252",
                "255.255.255.240",
                "255.255.255.192",
                "255.255.255.224"
            ],
            [
                4
            ]
        ],
        [
            157,
            "TEMP=\"pic19.png\"Обратитесь к рисунку. Сеть разбита на подсети. Учитывая адрес сети 192.168.5.0 и маску подсети 255.255.255.224, сколько всего адресов узлов не используется в назначенных подсетях?",
            [
                "72",
                "56",
                "64",
                "68",
                "60"
            ],
            [
                0
            ]
        ],
        [
            158,
            "Если сетевое устройство имеет маску /28, сколько IP-адресов доступно для хостов в этой сети?",
            [
                "32",
                "62",
                "16",
                "254",
                "256",
                "14"
            ],
            [
                5
            ]
        ],
        [
            159,
            "Сколько адресов узлов доступно в сети 172.16.128.0 с маской подсети 255.255.252.0?",
            [
                "510",
                "2046",
                "1022",
                "512",
                "2048",
                "1024"
            ],
            [
                2
            ]
        ],
        [
            160,
            "Рассмотрим следующий диапазон адресов:\n2001:0DB8:BC15:00A0:0000::\n2001:0DB8:BC15:00A1:0000::\n2001:0DB8:BC15:00A2:0000::\n…\n2001:0DB8:BC15:00AF:0000::\nКакая длина префикса для этого диапазона адресов?",
            [
                "60"
            ],
            [
                0
            ]
        ],
        [
            161,
            "Сетевой администратор разбивает сеть на подсети. Самая маленькая подсеть имеет маску 255.255.255.248. Сколько пригодных для использования адресов узлов будет предоставлять эта подсеть?",
            [
                "10",
                "4",
                "12",
                "6",
                "8"
            ],
            [
                3
            ]
        ],
        [
            162,
            "TEMP=\"pic20.png\"Обратитесь к рисунку. Сетевой администратор назначил локальной сети LBMISS диапазон адресов 192.168.10.0. Этот диапазон адресов разделен на подсети с использованием префикса /29, используются первые четыре подсети (нулевая подсеть является первой по счету подсетью). Для нового здания технический специалист решил использовать пятую подсеть. В соответствии с политиками компании интерфейсу маршрутизатора всегда назначается первый доступный адрес узла, а серверу рабочей группы — последний доступный адрес узла. Какую конфигурацию следует указать в свойствах сервера рабочей группы, чтобы разрешить подключение к Интернет?",
            [
                "IP-адрес: 192.168.10.65 Маска подсети: 255.255.255.240, шлюз по умолчанию: 192.168.10.76",
                "IP-адрес: 192.168.10.38 Маска подсети: 255.255.255.240, шлюз по умолчанию: 192.168.10.33",
                "IP-адрес: 192.168.10.38, маска подсети: 255.255.255.248, шлюз по умолчанию: 192.168.10.33",
                "IP-адрес: 192.168.10.41 Маска подсети: 255.255.255.248, шлюз по умолчанию: 192.168.10.46",
                "IP-адрес: 192.168.10.254 Маска подсети: 255.255.255.0, шлюз по умолчанию: 192.168.10.1"
            ],
            [
                2
            ]
        ],
        [
            163,
            "Что делает TCP, если отправляющий хост обнаруживает перегрузку сети на пути к месту назначения?",
            [
                "Хост назначения запросит повторную передачу всего сообщения.",
                "Хост-источник уменьшит объем данных, которые он отправляет, прежде чем он должен будет получить подтверждения от получателя.",
                "Источник подтвердит отправку последнего сегмента и включит в сообщение запрос на меньший размер окна.",
                "Хост-источник отправит запрос на более частые подтверждения к месту назначения."
            ],
            [
                1
            ]
        ],
        [
            164,
            "Какая характеристика относится к серверному процессу TCP?",
            [
                "На сервере может быть одновременно открыто много портов, по одному для каждого активного серверного приложения.",
                "Хост, на котором запущено два разных приложения, может быть настроен на использование одного и того же порта сервера.",
                "Каждый процесс приложения, работающий на сервере, должен быть настроен на использование динамического номера порта.",
                "Отдельный сервер может иметь две службы, назначенные одному и тому же номеру порта в рамках одних и тех же служб транспортного уровня."
            ],
            [
                0
            ]
        ],
        [
            165,
            "Хост-устройство должно отправить большой видеофайл по сети, обеспечивая передачу данных другим пользователям. Какая функция позволит одновременно передавать разные потоки данных, не используя всю доступную полосу пропускания для единого потока данных?",
            [
                "мультиплексирование",
                "размер окна",
                "подтверждение",
                "номера портов"
            ],
            [
                0
            ]
        ],
        [
            166,
            "Какой фактор определяет размер окна TCP?",
            [
                "объем данных, который источник может отправить за один раз",
                "количество сервисов, включенных в сегмент TCP",
                "объем данных, которые необходимо передать",
                "количество данных, которое пункт назначения может обработать за один раз"
            ],
            [
                3
            ]
        ],
        [
            167,
            "Когда UDP предпочтительнее TCP?",
            [
                "когда приложение может допустить некоторую потерю данных во время передачи",
                "когда клиент отправляет сегмент на сервер",
                "когда все данные должны быть полностью получены, прежде чем какая-либо их часть будет считаться полезной",
                "когда сегменты должны поступать в строго определенной последовательности для успешной обработки"
            ],
            [
                0
            ]
        ],
        [
            168,
            "Почему HTTP использует TCP в качестве протокола транспортного уровня?",
            [
                "потому что HTTP — это протокол наилучших усилий",
                "потому что HTTP требует надежной доставки",
                "потому что ошибки передачи можно легко допустить",
                "чтобы обеспечить максимально возможную скорость загрузки"
            ],
            [
                1
            ]
        ],
        [
            169,
            "Что произойдет, если первый пакет передачи TFTP будет потерян?",
            [
                "Маршрутизатор следующего перехода или шлюз по умолчанию отправит ответ с кодом ошибки.",
                "Приложение TFTP повторит запрос, если ответ не получен.",
                "Транспортный уровень повторит запрос, если ответ не получен.",
                "Клиент будет ждать ответа бесконечно долго."
            ],
            [
                1
            ]
        ],
        [
            170,
            "Что характерно для UDP?",
            [
                "Приложения, использующие UDP, всегда считаются ненадежными.",
                "UDP повторно собирает полученные дейтаграммы в том порядке, в котором они были получены.",
                "Дейтаграммы UDP проходят по одному и тому же пути и достигают места назначения в правильном порядке.",
                "UDP передает данные в сеть только тогда, когда пункт назначения готов принять данные."
            ],
            [
                1
            ]
        ],
        [
            171,
            "Какая информация используется TCP для повторной сборки и изменения порядка полученных сегментов?",
            [
                "номера фрагментов",
                "порядковые номера",
                "номера подтверждения",
                "номера портов"
            ],
            [
                1
            ]
        ],
        [
            172,
            "Что делает клиент, когда ему нужно отправить дейтаграммы UDP?",
            [
                "Он отправляет на сервер упрощенное трехстороннее рукопожатие.",
                "Он просто отправляет дейтаграммы.",
                "Он отправляет на сервер сегмент с установленным флагом SYN для синхронизации разговора.",
                "Он запрашивает сервер, чтобы узнать, готов ли он принимать данные."
            ],
            [
                1
            ]
        ],
        [
            173,
            "Что произойдет, если часть FTP-сообщения не будет доставлена получателю?",
            [
                "Хост-источник FTP отправляет запрос хосту-получателю.",
                "Сообщение потеряно, так как FTP не использует надежный метод доставки.",
                "Полное сообщение FTP отправляется повторно.",
                "Утерянная часть FTP-сообщения отправляется повторно."
            ],
            [
                3
            ]
        ],
        [
            174,
            "Какие две характеристики связаны с сеансами UDP? (Выберите два.)",
            [
                "Полученные данные не подтверждаются",
                "Передаваемые сегменты данных отслеживаются.",
                "Целевые устройства собирают сообщения и передают их приложению.",
                "Неподтвержденные пакеты данных передаются повторно.",
                "Целевые устройства получают трафик с минимальной задержкой."
            ],
            [
                0,
                4
            ]
        ],
        [
            175,
            "Во время сеанса TCP целевое устройство отправляет номер подтверждения исходному устройству. Что означает номер подтверждения?",
            [
                "общее количество байтов, которые были получены",
                "следующий байт, который пункт назначения ожидает получить",
                "на одно число больше, чем порядковый номер",
                "последний порядковый номер, отправленный источником"
            ],
            [
                1
            ]
        ],
        [
            176,
            "Какой тип информации включается в заголовок транспортного уроня?",
            [
                "физический адрес назначения и источника",
                "логические адреса назначения и источника",
                "номера портов назначения и источника",
                "закодированные данные приложения"
            ],
            [
                2
            ]
        ],
        [
            177,
            "ПК загружает большой файл с сервера. Окно TCP составляет 1000 байт. Сервер отправляет файл, используя 100-байтовые сегменты. Сколько сегментов отправит сервер, прежде чем потребуется подтверждение от ПК?",
            [
                "100 сегментов",
                "10 сегментов",
                "1000 сегментов",
                "1 сегмент"
            ],
            [
                1
            ]
        ],
        [
            178,
            "Хост-устройство принимает потоковое видео в реальном времени. Как устройство учитывает видеоданные, потерянные во время передачи?",
            [
                "Устройство продолжит прием потокового видео, но возможны кратковременные сбои.",
                "Устройство будет задерживать потоковое видео до тех пор, пока не будет получен весь видеопоток.",
                "Устройство будет использовать порядковые номера для приостановки видеопотока, пока не поступят правильные данные.",
                "Устройство немедленно запросит повторную передачу недостающих данных."
            ],
            [
                0
            ]
        ],
        [
            179,
            "Какие два флага в заголовке TCP используются в трехстороннем рукопожатии TCP для установления соединения между двумя сетевыми устройствами? (Выберите два.)",
            [
                "PSH",
                "RST",
                "SYN",
                "FIN",
                "ACK",
                "URG"
            ],
            [
                2,
                4
            ]
        ],
        [
            180,
            "Что такое сокет-адрес?",
            [
                "комбинация исходной и конечной последовательностей и номеров подтверждений",
                "комбинация исходного и целевого IP-адреса и исходного и целевого Ethernet-адреса",
                "комбинация исходных и целевых порядковых номеров и номеров портов",
                "комбинация исходного IP-адреса и номера порта или целевого IP-адреса и номера порта"
            ],
            [
                3
            ]
        ],
        [
            181,
            "Какой тип порта необходимо запросить у IANA, чтобы его можно было использовать с конкретным приложением?",
            [
                "dynamic port",
                "source port",
                "private port",
                "registered port"
            ],
            [
                3
            ]
        ],
        [
            182,
            "Каков полный диапазон общеизвестных портов (well-known ports) TCP и UDP?",
            [
                "256 – 1023",
                "от 0 до 255",
                "от 0 до 1023",
                "1024 – 49151"
            ],
            [
                2
            ]
        ],
        [
            183,
            "Какие три протокола прикладного уровня используют TCP? (Выберите три.)",
            [
                "SNMP",
                "SMTP",
                "TFTP",
                "HTTP",
                "DHCP",
                "FTP"
            ],
            [
                1,
                3,
                5
            ]
        ],
        [
            184,
            "Какой флаг в заголовке TCP используется в ответ на полученный FIN для разрыва соединения между двумя сетевыми устройствами?",
            [
                "RST",
                "ACK",
                "FIN",
                "SYN"
            ],
            [
                1
            ]
        ],
        [
            185,
            "В чем преимущество для небольших организаций использования IMAP вместо POP?",
            [
                "IMAP отправляет и получает электронную почту, но POP получает только электронную почту.",
                "Когда пользователь подключается к POP-серверу, копии сообщений хранятся на почтовом сервере в течение короткого времени, но IMAP хранит их в течение длительного времени.",
                "POP позволяет клиенту хранить сообщения только централизованно, тогда как IMAP допускает распределенное хранение.",
                "Сообщения хранятся на почтовых серверах до тех пор, пока они не будут вручную удалены из почтового клиента."
            ],
            [
                3
            ]
        ],
        [
            186,
            "TEMP=\"pic21.png\"Обратитесь к рисункту. Базовая документация для небольшой компании содержала статистику времени прохождения ping-запросов 36/97/132 между хостами H1 и H3. Сегодня сетевой администратор проверил соединение, отправив эхо-запрос между хостами H1 и H3, в результате чего время прохождения туда и обратно составило 1458/2390/6066. О чем это говорит сетевому администратору?",
            [
                "Производительность между сетями находится в пределах ожидаемых параметров.",
                "Что-то вызывает помехи между H1 и R1.",
                "H3 неправильно подключен к сети.",
                "Связь между H1 и H3 в порядке.",
                "Что-то вызывает временную задержку между сетями."
            ],
            [
                4
            ]
        ],
        [
            187,
            "Какой протокол прикладного уровня использует такие типы сообщений, как GET, PUT и POST?",
            [
                "HTTP",
                "DHCP",
                "SMTP",
                "DNS",
                "POP3"
            ],
            [
                0
            ]
        ],
        [
            188,
            "Какие два типа трафика чувствительны к задержке доставки? (Выберите два.)",
            [
                "video",
                "voice",
                "FTP",
                "web",
                "email"
            ],
            [
                0,
                1
            ]
        ],
        [
            189,
            "Что является примером сетевого взаимодействия, использующего модель клиент-сервер?",
            [
                "Рабочая станция инициирует ARP, чтобы найти MAC-адрес хоста-получателя.",
                "Рабочая станция инициирует DNS-запрос, когда пользователь вводит www.cisco.com в адресную строку веб-браузера.",
                "Пользователь использует eMule для загрузки файла, которым поделился друг, после определения местоположения файла.",
                "Пользователь печатает документ с помощью принтера, подключенного к рабочей станции коллеги."
            ],
            [
                1
            ]
        ],
        [
            190,
            "Какие два действия можно предпринять, чтобы предотвратить успешную сетевую атаку на учетную запись сервера электронной почты? (Выберите два.)",
            [
                "Ограничьте количество неудачных попыток входа на сервер.",
                "Никогда не используйте пароли, для которых нужна клавиша Shift.",
                "Используйте серверы разных производителей.",
                "Никогда не отправляйте пароль по сети в открытом виде.",
                "Распределите серверы по всему зданию, расположив их рядом с заинтересованными сторонами."
            ],
            [
                0,
                3
            ]
        ],
        [
            191,
            "Какое утверждение о CDP на устройстве Cisco верно?",
            [
                "Команда show cdp neighbor detail покажет IP-адрес соседа, только если есть возможность подключения уровня 3.",
                "Для глобального отключения CDP необходимо использовать команду no cdp enable в режиме настройки интерфейса.",
                "Поскольку протокол CDP работает на канальном уровне, он может быть реализован только в коммутаторах.",
                "CDP можно отключить глобально или на конкретном интерфейсе."
            ],
            [
                0
            ]
        ],
        [
            192,
            "Какова цель использования SSH для подключения к маршрутизатору?",
            [
                "Это позволяет настроить маршрутизатор с помощью графического интерфейса.",
                "Это позволяет безопасно передавать образ программного обеспечения IOS с незащищенной рабочей станции или сервера.",
                "Это позволяет контролировать маршрутизатор с помощью приложения для управления сетью.",
                "Это позволяет безопасное удаленное подключение к интерфейсу командной строки маршрутизатора."
            ],
            [
                3
            ]
        ],
        [
            193,
            "Сетевой администратор небольшой кампусной сети ввел на коммутаторе команду show ip interface brief. Что администратор проверяет с помощью этой команды?",
            [
                "шлюз по умолчанию, который используется коммутатором",
                "что определенный хост в другой сети может быть достигнут",
                "статус интерфейсов коммутатора и адрес, настроенный на интерфейсе vlan 1",
                "путь, который используется для доступа к определенному хосту в другой сети"
            ],
            [
                2
            ]
        ],
        [
            194,
            "Какая фраза описывает демона FTP?",
            [
                "диагностическая программа FTP",
                "программа, работающая на FTP-сервере",
                "приложение, которое используется для запроса данных с FTP-сервера",
                "программа, работающая на FTP-клиенте"
            ],
            [
                1
            ]
        ],
        [
            195,
            "Какой протокол используется для безопасного обмена данными с веб-сервером?",
            [
                "HTTPS"
            ],
            [
                0
            ]
        ],
        [
            196,
            "Какие два определения точно описывают соответствующий протокол прикладного уровня? (Выберите два.)",
            [
                "Telnet — обеспечивает удаленный доступ к серверам и сетевым устройствам.",
                "SMTP — передает веб-страницы с веб-серверов клиентам.",
                "FTP – передает сообщения электронной почты и вложения",
                "HTTP — позволяет устройствам в сети получать IP-адреса.",
                "DNS — преобразует интернет-имена в IP-адреса."
            ],
            [
                0,
                4
            ]
        ],
        [
            197,
            "Каковы две характеристики прикладного уровня модели TCP/IP? (Выберите два.)",
            [
                "ответственность за физическую адресацию",
                "ближайший к конечному пользователю",
                "создание и поддержание диалога между исходным и целевым приложениями",
                "ответственность за логическую адресацию",
                "установление размера окна"
            ],
            [
                1,
                2
            ]
        ],
        [
            198,
            "Введите пропущенные слова. Не используйте сокращения и лишние пробелы.Команда __, выдаваемая на маршрутизаторе, используется для проверки значения регистра конфигурации программного обеспечения.",
            [
                "show version"
            ],
            [
                0
            ]
        ],
        [
            199,
            "Какие два утверждения описывают процедуру оценки схемы потоков трафика и типы сетевого трафика с помощью анализатора протоколов? (Выберите два.)",
            [
                "Захватывайте трафик только в тех областях сети, которые получают большую часть трафика, таких как центр обработки данных.",
                "Захватите трафик в часы пиковой загрузки, чтобы получить хорошее представление о различных типах трафика.",
                "Захватывайте только трафик WAN, потому что трафик в Интернете отвечает за наибольший объем трафика в сети.",
                "Захват трафика в выходные дни, когда большинство сотрудников не работают.",
                "Выполните захват в разных сегментах сети."
            ],
            [
                1,
                4
            ]
        ],
        [
            200,
            "Введите пропущенные слова. Не используйте сокращения и лишние пробелы.\n__ определяет протоколы и технологии, реализующие передачу голосовых данных по IP-сети",
            [
                "VoIP"
            ],
            [
                0
            ]
        ],
        [
            201,
            "Какую команду следует использовать на маршрутизаторе или коммутаторе Cisco, чтобы разрешить отображение сообщений журнала для удаленно подключенных сеансов с использованием Telnet или SSH?",
            [
                "logging synchronous",
                "debug all",
                "show running-config",
                "terminal monitor"
            ],
            [
                3
            ]
        ],
        [
            202,
            "TEMP=\"pic22.png\"Обратитесь к рисунку.\nКакая команда использовалась для разрешения заданного имени хоста путем запроса серверов имен?",
            [
                "NSLOOKUP"
            ],
            [
                0
            ]
        ],
        [
            203,
            "Какие три утверждения описывают сообщение DHCP Discover? (Выберите три.)",
            [
                "Сообщение приходит с сервера, предлагающего IP-адрес.",
                "Все хосты получают сообщение, но отвечает только сервер DHCP.",
                "IP-адрес назначения — 255.255.255.255.",
                "Сообщение приходит от клиента, которому нужен IP-адрес.",
                "Только сервер DHCP получает сообщение.",
                "MAC-адрес источника состоит из 48 единиц (FF-FF-FF-FF-FF-FF)."
            ],
            [
                1,
                2,
                3
            ]
        ],
        [
            204,
            "Какая команда создаст резервную копию конфигурации, хранящейся в NVRAM, на TFTP-сервере?",
            [
                "copy running-config tftp",
                "copy startup-config tftp",
                "copy tftp running-config",
                "copy tftp startup-config"
            ],
            [
                1
            ]
        ],
        [
            205,
            "Какие две задачи может выполнять локальный DNS-сервер? (Выберите два.)",
            [
                "пересылка запросов на разрешение имен между серверами",
                "сопоставление имен и IP-адресов для внутренних хостов",
                "получение сообщений электронной почты",
                "предоставление IP-адресов локальным хостам",
                "возможность передачи данных между двумя сетевыми устройствами"
            ],
            [
                0,
                1
            ]
        ],
        [
            206,
            "Сетевой администратор небольшой компании обдумывает, как масштабировать сеть в течение следующих трех лет, чтобы приспособиться к прогнозируемому росту. Какие три типа информации следует использовать для планирования роста сети? (Выберите три.)",
            [
                "инвентаризация устройств, которые в данный момент используются в сети",
                "кадровая политика и процедуры для всех сотрудников компании",
                "история и миссия компании",
                "анализ сетевого трафика на основе протоколов, приложений и сервисов, используемых в сети",
                "документирование текущих физических и логических топологий",
                "список действующих сотрудников и их роль в компании"
            ],
            [
                0,
                3,
                4
            ]
        ],
        [
            207,
            "Какой тип HTTP-сообщения используется клиентом для запроса данных с веб-сервера?",
            [
                "GET"
            ],
            [
                0
            ]
        ],
        [
            208,
            "Прикладной уровень модели TCP/IP выполняет функции каких трех уровней модели OSI? (Выберите три.)",
            [
                "network",
                "session",
                "transport",
                "application",
                "physical",
                "presentation",
                "data link"
            ],
            [
                1,
                3,
                5
            ]
        ],
        [
            209,
            "Какое соображение при проектировании сети будет важнее для крупной корпорации, чем для малого бизнеса?",
            [
                "коммутатор с низкой плотностью портов",
                "Интернет-роутер",
                "избыточность",
                "межсетевой экран"
            ],
            [
                2
            ]
        ],
        [
            210,
            "Какова цель функции аутентификации при обеспечении сетевой безопасности?",
            [
                "задавать вопросы и ответы на них",
                "требовать от пользователей доказательств -&nbsp; кто они",
                "отслеживать действия пользователя",
                "чтобы определить, к каким ресурсам пользователь может получить доступ"
            ],
            [
                1
            ]
        ],
        [
            211,
            "Некоторые маршрутизаторы и коммутаторы в коммутационном шкафу вышли из строя после поломки кондиционера. Какой тип угрозы описывает данная ситуация?",
            [
                "электрическая",
                "относящийся к окружающей среде",
                "конфигурации",
                "обслуживания"
            ],
            [
                1
            ]
        ],
        [
            212,
            "Какой уровень в модели TCP/IP используется для форматирования, сжатия и шифрования данных?",
            [
                "presentation",
                "application",
                "session",
                "network access",
                "internetwork"
            ],
            [
                1
            ]
        ],
        [
            213,
            "Промышленная компания подписывается на определенные услуги хостинга у своего интернет-провайдера. Требуемые услуги включают WEB-хостинг, передачу файлов и электронную почту. Какие протоколы представляют эти ключевых приложения? (Выберите три.)",
            [
                "SNMP",
                "DNS",
                "FTP",
                "SMTP",
                "DHCP"
            ],
            [
                1,
                2,
                3
            ]
        ],
        [
            214,
            "Недавно нанятому сетевому специалисту поручают заказать новое оборудование для малого бизнеса с большим прогнозом роста. На какой основной фактор должен обращать внимание технический специалист при выборе новых устройств?",
            [
                "резервированные устройства",
                "устройства, поддерживающие мониторинг сети",
                "устройства с фиксированным количеством и типом интерфейсов",
                "устройства с поддержкой модульности"
            ],
            [
                3
            ]
        ],
        [
            215,
            "Когда администратор должен оценивать параметры базового уровня сети?",
            [
                "через равные промежутки времени в течение определенного периода времени",
                "в самой низкой точке трафика в сети",
                "когда трафик в сети находится на пике",
                "при резком падении трафика"
            ],
            [
                0
            ]
        ],
        [
            216,
            "Введите пропущенные слова. Не используйте сокращения и лишние пробелы.\nКоманда show __ предоставляет информацию по количестве свободной памяти nvram и flash с разрешениями на чтение или запись данных.",
            [
                "file systems"
            ],
            [
                0
            ]
        ],
        [
            217,
            "Какова цель выдачи команд\ncd nvram:\ndir\n в привилегированном режиме exec маршрутизатора?",
            [
                "скопировать каталоги из NVRAM",
                "вывести содержимое NVRAM",
                "очистить содержимое NVRAM",
                "направлять все новые файлы в NVRAM"
            ],
            [
                1
            ]
        ],
        [
            218,
            "Сетевой техник выдает команду\narp -d *\nна ПК после перенастройки маршрутизатора, подключенного к локальной сети. Каков результат после выполнения этой команды?",
            [
                "Кэш ARP очищается.",
                "Кэш ARP синхронизируется с интерфейсом маршрутизатора.",
                "Отображается подробная информация о кэше ARP.",
                "Отображается текущее содержимое кэша ARP."
            ],
            [
                0
            ]
        ],
        [
            219,
            "Какой протокол прикладного уровня используется для предоставления услуг обмена файлами и печати для приложений Microsoft?",
            [
                "SMB",
                "SMTP",
                "DHCP",
                "HTTP"
            ],
            [
                0
            ]
        ],
        [
            220,
            "Какое утверждение об FTP верно?",
            [
                "FTP не обеспечивает надежность при передаче данных.",
                "Клиент может загружать данные с сервера или загружать данные на сервер.",
                "Клиент может выбрать, будет ли FTP устанавливать одно или два соединения с сервером.",
                "FTP — это одноранговое приложение."
            ],
            [
                1
            ]
        ],
        [
            221,
            "Что верно в отношении протокола Server Message Block?",
            [
                "Сообщения SMB не могут аутентифицировать сеанс.",
                "Клиенты устанавливают долгосрочное соединение с серверами.",
                "Различные типы сообщений SMB имеют разный формат.",
                "SMB использует протокол FTP для связи."
            ],
            [
                2
            ]
        ],
        [
            222,
            "Какие два шага необходимы для включения SSH на маршрутизаторе Cisco? (Выберите два.)",
            [
                "Создайте набор секретных ключей, которые будут использоваться для шифрования и дешифрования.",
                "Дайте маршрутизатору имя хоста и доменное имя.",
                "Включите SSH на физических интерфейсах, где будут приниматься входящие запросы на подключение.",
                "Настройте сервер аутентификации для обработки входящих запросов на подключение.",
                "Создайте баннер, который будет отображаться для пользователей при подключении."
            ],
            [
                0,
                1
            ]
        ],
        [
            223,
            "При извлечении сообщений электронной почты какой протокол обеспечивает простое централизованное хранение и резервное копирование сообщений электронной почты, что было бы желательно для предприятий малого и среднего бизнеса?",
            [
                "HTTPS",
                "POP",
                "IMAP",
                "SMTP"
            ],
            [
                2
            ]
        ],
        [
            224,
            "Сетевой администратор использует на маршрутизаторе команду\nlogin block-for 180 attempts 2 within 30.\nКакую угрозу пытается предотвратить сетевой администратор?",
            [
                "устройство, которое пытается проверить трафик по ссылке",
                "червь, который пытается получить доступ к другой части сети",
                "неопознанное лицо, пытающееся получить доступ к сетевому оборудованию",
                "пользователь, пытающийся подобрать пароль для доступа к роутеру"
            ],
            [
                3
            ]
        ],
        [
            225,
            "TEMP=\"pic23.png\"Обратитесь к рисунку. Администратор пытается устранить неполадки подключения между ПК1 и ПК2 и использует для этого команду tracert с ПК1. Основываясь на отображаемом выводе, с чего администратору следует начать устранение неполадок?",
            [
                "R1",
                "R2",
                "SW2",
                "ПК2",
                "SW1"
            ],
            [
                0
            ]
        ],
        [
            226,
            "Какая функция брандмауэра используется для обеспечения того, чтобы пакеты, входящие в сеть, были законными ответами, инициированными внутренними хостами?",
            [
                "packet filtering",
                "application filtering",
                "URL filtering",
                "stateful packet inspection"
            ],
            [
                3
            ]
        ],
        [
            227,
            "Сетевой техник выполняет команду\nC:\\> tracert -6 www.cisco.com\nна ПК с Windows. Какова цель опции команды -6?",
            [
                "Это заставляет трассировку использовать IPv6.",
                "Он устанавливает тайм-аут в 6 миллисекунд для каждого повтора.",
                "Он отправляет 6 запросов в течение каждого периода времени TTL.",
                "Это ограничивает трассировку только 6 прыжками."
            ],
            [
                0
            ]
        ],
        [
            228,
            "Какая часть URL-адреса, http://www.cisco.com/index.html, представляет домен DNS верхнего уровня?",
            [
                ".com",
                "http",
                "www",
                "index"
            ],
            [
                0
            ]
        ],
        [
            229,
            "Что общего между клиент-серверной и одноранговой сетевыми моделями?",
            [
                "Обе модели требуют использования протоколов на основе TCP/IP.",
                "Обе модели используются только в проводной сетевой среде.",
                "Обе модели имеют выделенные серверы.",
                "Обе модели поддерживают устройства в роли сервера и клиента."
            ],
            [
                3
            ]
        ],
        [
            230,
            "Какой тип сетевой угрозы парируется для предотвращения доступа авторизованных пользователей к ресурсам?",
            [
                "злоупотребление доверем",
                "DoS-атаки",
                "атаки доступа",
                "разведывательные атаки"
            ],
            [
                2
            ]
        ],
        [
            231,
            "Два студента работают над сетевым проектом. Один студент рисует, а другой пишет предложение. Рисунок закончен, и студент хочет поделиться папкой, содержащей рисунок, чтобы другой студент мог получить доступ к файлу и скопировать его на USB-накопитель. Какая сетевая модель используется?",
            [
                "client-based",
                "master-slave",
                "point-to-point",
                "peer-to-peer"
            ],
            [
                3
            ]
        ]
    ]
}
